Revit 2024 API
RebarInSystem.Quantity Property
 Identifies the number of bars in rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int Quantity { get; }
Visual Basic
Public ReadOnly Property Quantity As Integer
	Get
Visual C++
public:
property int Quantity {
	int get ();
}
Remarks
 Quantity is equal to NumberOfBarPositions if all the bars are included. If any bars are excluded, they are not counted in the Quantity.
See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace